In [4]:
import pandas as pd

student_dict = {'Name': ['Joe', 'Nat', 'Harry','Jack','Jose','Jill','Rose'],
                'Age': [20, 21, 19,17,18,19,17],
                'Marks': [85.10, 77.80, 91.54,72,87.9,90,72]
               }
#create DataFrame from dict
df = pd.DataFrame(student_dict)
print(df.head(5))

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54
3   Jack   17  72.00
4   Jose   18  87.90

In [66]:
pip install pandas

SyntaxError: invalid syntax (2554050767.py, line 1)

In [70]:
pip install numpy

Requirement already satisfied: numpy in c:\users\hoang\anaconda3\lib\site-packages (1.26.4)
Note: you may need to restart the kernel to use updated packages.

In [58]:
import pandas as pd

file_path = r"H:\Data Analysis\Python\CSV\Automobile_data.csv"
df = pd.read_csv(file_path)

#adjust pandas setting

pd.set_option("display.max_columns",None) # show all column
pd.set_option("display.max_rows",None) # show all row
pd.set_option("display.width",1000) # increase column width
print(df)

print(df.isnull().sum()) #identify missing value
print(df.duplicated().sum()) #identify dup values

    index        company   body-style  wheel-base  length engine-type num-of-cylinders  horsepower  average-mileage    price
0       0    alfa-romero  convertible        88.6   168.8        dohc             four         111               21  13495.0
1       1    alfa-romero  convertible        88.6   168.8        dohc             four         111               21  16500.0
2       2    alfa-romero    hatchback        94.5   171.2        ohcv              six         154               19  16500.0
3       3           audi        sedan        99.8   176.6         ohc             four         102               24  13950.0
4       4           audi        sedan        99.4   176.6         ohc             five         115               18  17450.0
5       5           audi        sedan        99.8   177.3         ohc             five         110               19  15250.0
6       6           audi        wagon       105.8   192.7         ohc             five         110               19  18920.0
7       9            bmw        sedan       101.2   176.8         ohc             four         101               23  16430.0
8      10            bmw        sedan       101.2   176.8         ohc             four         101               23  16925.0
9      11            bmw        sedan       101.2   176.8         ohc              six         121               21  20970.0
10     13            bmw        sedan       103.5   189.0         ohc              six         182               16  30760.0
11     14            bmw        sedan       103.5   193.8         ohc              six         182               16  41315.0
12     15            bmw        sedan       110.0   197.0         ohc              six         182               15  36880.0
13     16      chevrolet    hatchback        88.4   141.1           l            three          48               47   5151.0
14     17      chevrolet    hatchback        94.5   155.9         ohc             four          70               38   6295.0
15     18      chevrolet        sedan        94.5   158.8         ohc             four          70               38   6575.0
16     19          dodge    hatchback        93.7   157.3         ohc             four          68               31   6377.0
17     20          dodge    hatchback        93.7   157.3         ohc             four          68               31   6229.0
18     27          honda        wagon        96.5   157.1         ohc             four          76               30   7295.0
19     28          honda        sedan        96.5   175.4         ohc             four         101               24  12945.0
20     29          honda        sedan        96.5   169.1         ohc             four         100               25  10345.0
21     30          isuzu        sedan        94.3   170.7         ohc             four          78               24   6785.0
22     31          isuzu        sedan        94.5   155.9         ohc             four          70               38      NaN
23     32          isuzu        sedan        94.5   155.9         ohc             four          70               38      NaN
24     33         jaguar        sedan       113.0   199.6        dohc              six         176               15  32250.0
25     34         jaguar        sedan       113.0   199.6        dohc              six         176               15  35550.0
26     35         jaguar        sedan       102.0   191.7        ohcv           twelve         262               13  36000.0
27     36          mazda    hatchback        93.1   159.1         ohc             four          68               30   5195.0
28     37          mazda    hatchback        93.1   159.1         ohc             four          68               31   6095.0
29     38          mazda    hatchback        93.1   159.1         ohc             four          68               31   6795.0
30     39          mazda    hatchback        95.3   169.0       rotor              two         101               17  11845.0
31     43          mazda        sedan       104.9   175.0         ohc             four          72               31  18344.0
32     44  mercedes-benz        sedan       110.0   190.9         ohc             five         123               22  25552.0
33     45  mercedes-benz        wagon       110.0   190.9         ohc             five         123               22  28248.0
34     46  mercedes-benz        sedan       120.9   208.1        ohcv            eight         184               14  40960.0
35     47  mercedes-benz      hardtop       112.0   199.2        ohcv            eight         184               14  45400.0
36     49     mitsubishi    hatchback        93.7   157.3         ohc             four          68               37   5389.0
37     50     mitsubishi    hatchback        93.7   157.3         ohc             four          68               31   6189.0
38     51     mitsubishi        sedan        96.3   172.4         ohc             four          88               25   6989.0
39     52     mitsubishi        sedan        96.3   172.4         ohc             four          88               25   8189.0
40     53         nissan        sedan        94.5   165.3         ohc             four          55               45   7099.0
41     54         nissan        sedan        94.5   165.3         ohc             four          69               31   6649.0
42     55         nissan        sedan        94.5   165.3         ohc             four          69               31   6849.0
43     56         nissan        wagon        94.5   170.2         ohc             four          69               31   7349.0
44     57         nissan        sedan       100.4   184.6        ohcv              six         152               19  13499.0
45     61        porsche      hardtop        89.5   168.9        ohcf              six         207               17  34028.0
46     62        porsche  convertible        89.5   168.9        ohcf              six         207               17  37028.0
47     63        porsche    hatchback        98.4   175.7       dohcv            eight         288               17      NaN
48     66         toyota    hatchback        95.7   158.7         ohc             four          62               35   5348.0
49     67         toyota    hatchback        95.7   158.7         ohc             four          62               31   6338.0
50     68         toyota    hatchback        95.7   158.7         ohc             four          62               31   6488.0
51     69         toyota        wagon        95.7   169.7         ohc             four          62               31   6918.0
52     70         toyota        wagon        95.7   169.7         ohc             four          62               27   7898.0
53     71         toyota        wagon        95.7   169.7         ohc             four          62               27   8778.0
54     79         toyota        wagon       104.5   187.8        dohc              six         156               19  15750.0
55     80     volkswagen        sedan        97.3   171.7         ohc             four          52               37   7775.0
56     81     volkswagen        sedan        97.3   171.7         ohc             four          85               27   7975.0
57     82     volkswagen        sedan        97.3   171.7         ohc             four          52               37   7995.0
58     86     volkswagen        sedan        97.3   171.7         ohc             four         100               26   9995.0
59     87          volvo        sedan       104.3   188.8         ohc             four         114               23  12940.0
60     88          volvo        wagon       104.3   188.8         ohc             four         114               23  13415.0
index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64
0

In [60]:
import pandas as pd

file_path = r"H:\Data Analysis\Python\CSV\Automobile_data.csv"
df = pd.read_csv(file_path)

#adjust pandas setting

pd.set_option("display.max_columns",None) # show all column
pd.set_option("display.max_rows",None) # show all row
pd.set_option("display.width",1000) # increase column width
df = df.dropna()
print(df)

    index        company   body-style  wheel-base  length engine-type num-of-cylinders  horsepower  average-mileage    price
0       0    alfa-romero  convertible        88.6   168.8        dohc             four         111               21  13495.0
1       1    alfa-romero  convertible        88.6   168.8        dohc             four         111               21  16500.0
2       2    alfa-romero    hatchback        94.5   171.2        ohcv              six         154               19  16500.0
3       3           audi        sedan        99.8   176.6         ohc             four         102               24  13950.0
4       4           audi        sedan        99.4   176.6         ohc             five         115               18  17450.0
5       5           audi        sedan        99.8   177.3         ohc             five         110               19  15250.0
6       6           audi        wagon       105.8   192.7         ohc             five         110               19  18920.0
7       9            bmw        sedan       101.2   176.8         ohc             four         101               23  16430.0
8      10            bmw        sedan       101.2   176.8         ohc             four         101               23  16925.0
9      11            bmw        sedan       101.2   176.8         ohc              six         121               21  20970.0
10     13            bmw        sedan       103.5   189.0         ohc              six         182               16  30760.0
11     14            bmw        sedan       103.5   193.8         ohc              six         182               16  41315.0
12     15            bmw        sedan       110.0   197.0         ohc              six         182               15  36880.0
13     16      chevrolet    hatchback        88.4   141.1           l            three          48               47   5151.0
14     17      chevrolet    hatchback        94.5   155.9         ohc             four          70               38   6295.0
15     18      chevrolet        sedan        94.5   158.8         ohc             four          70               38   6575.0
16     19          dodge    hatchback        93.7   157.3         ohc             four          68               31   6377.0
17     20          dodge    hatchback        93.7   157.3         ohc             four          68               31   6229.0
18     27          honda        wagon        96.5   157.1         ohc             four          76               30   7295.0
19     28          honda        sedan        96.5   175.4         ohc             four         101               24  12945.0
20     29          honda        sedan        96.5   169.1         ohc             four         100               25  10345.0
21     30          isuzu        sedan        94.3   170.7         ohc             four          78               24   6785.0
24     33         jaguar        sedan       113.0   199.6        dohc              six         176               15  32250.0
25     34         jaguar        sedan       113.0   199.6        dohc              six         176               15  35550.0
26     35         jaguar        sedan       102.0   191.7        ohcv           twelve         262               13  36000.0
27     36          mazda    hatchback        93.1   159.1         ohc             four          68               30   5195.0
28     37          mazda    hatchback        93.1   159.1         ohc             four          68               31   6095.0
29     38          mazda    hatchback        93.1   159.1         ohc             four          68               31   6795.0
30     39          mazda    hatchback        95.3   169.0       rotor              two         101               17  11845.0
31     43          mazda        sedan       104.9   175.0         ohc             four          72               31  18344.0
32     44  mercedes-benz        sedan       110.0   190.9         ohc             five         123               22  25552.0
33     45  mercedes-benz        wagon       110.0   190.9         ohc             five         123               22  28248.0
34     46  mercedes-benz        sedan       120.9   208.1        ohcv            eight         184               14  40960.0
35     47  mercedes-benz      hardtop       112.0   199.2        ohcv            eight         184               14  45400.0
36     49     mitsubishi    hatchback        93.7   157.3         ohc             four          68               37   5389.0
37     50     mitsubishi    hatchback        93.7   157.3         ohc             four          68               31   6189.0
38     51     mitsubishi        sedan        96.3   172.4         ohc             four          88               25   6989.0
39     52     mitsubishi        sedan        96.3   172.4         ohc             four          88               25   8189.0
40     53         nissan        sedan        94.5   165.3         ohc             four          55               45   7099.0
41     54         nissan        sedan        94.5   165.3         ohc             four          69               31   6649.0
42     55         nissan        sedan        94.5   165.3         ohc             four          69               31   6849.0
43     56         nissan        wagon        94.5   170.2         ohc             four          69               31   7349.0
44     57         nissan        sedan       100.4   184.6        ohcv              six         152               19  13499.0
45     61        porsche      hardtop        89.5   168.9        ohcf              six         207               17  34028.0
46     62        porsche  convertible        89.5   168.9        ohcf              six         207               17  37028.0
48     66         toyota    hatchback        95.7   158.7         ohc             four          62               35   5348.0
49     67         toyota    hatchback        95.7   158.7         ohc             four          62               31   6338.0
50     68         toyota    hatchback        95.7   158.7         ohc             four          62               31   6488.0
51     69         toyota        wagon        95.7   169.7         ohc             four          62               31   6918.0
52     70         toyota        wagon        95.7   169.7         ohc             four          62               27   7898.0
53     71         toyota        wagon        95.7   169.7         ohc             four          62               27   8778.0
54     79         toyota        wagon       104.5   187.8        dohc              six         156               19  15750.0
55     80     volkswagen        sedan        97.3   171.7         ohc             four          52               37   7775.0
56     81     volkswagen        sedan        97.3   171.7         ohc             four          85               27   7975.0
57     82     volkswagen        sedan        97.3   171.7         ohc             four          52               37   7995.0
58     86     volkswagen        sedan        97.3   171.7         ohc             four         100               26   9995.0
59     87          volvo        sedan       104.3   188.8         ohc             four         114               23  12940.0
60     88          volvo        wagon       104.3   188.8         ohc             four         114               23  13415.0

In [128]:
import pandas as pd

file_path = r"H:\Data Analysis\Python\CSV\Automobile_data.csv"
df = pd.read_csv(file_path)

#adjust pandas setting

pd.set_option("display.max_columns",None) # show all column
pd.set_option("display.max_rows",None) # show all row
pd.set_option("display.width",1000) # increase column width
df = df.dropna(axis =0) # drop missing value row
df=df.reset_index() # reset index
a = df[["company","price"]] # show 2 column company and price
df = df [['company','price']][df.price==df['price'].max()] # sort desending price
print(df) # show the most expensive car

          company    price
33  mercedes-benz  45400.0

In [112]:
import pandas as pd
import numpy as np

data = {
    "name":["Joe","Sam","Harry"],
    "age":[20,21,19],
    "marks":[85.1,np.nan,91.54]
}
df=pd.DataFrame(data)
print(df)
df=df.dropna(axis=0)
print(df)
df=df.reset_index()
print(df)

    name  age  marks
0    Joe   20  85.10
1    Sam   21    NaN
2  Harry   19  91.54
    name  age  marks
0    Joe   20  85.10
2  Harry   19  91.54
   index   name  age  marks
0      0    Joe   20  85.10
1      2  Harry   19  91.54
0      Joe
1    Harry
Name: name, dtype: object

In [114]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
print(thisdict)

{'brand': 'Ford', 'model': 'Mustang', 'year': 1964}

In [160]:
import pandas as pd
fruit_list = [["Apple","Banana","Orange"],[180,120,5]]
fruit = fruit_list[0]
quantity = fruit_list[1]
fruit_dict = {
    "fruit":fruit,
    "quantity":quantity
}
df = pd.DataFrame(fruit_dict)
print(df)

    fruit  quantity
0   Apple       180
1  Banana       120
2  Orange         5

In [224]:
import pandas as pd
stu = {
    "Name":["Alice","Bob","Charlie"],
    "Age":[24,27,22],
    "City":["New York","Chicago","Boston"],
    "Marks":[85,78,92]
}
# create DataFrame 
df = pd.DataFrame(stu)
marks_mean = df["Marks"].mean() # find mean value of Marks column
marks_median = df["Marks"].median()
marks_std = df["Marks"].std()
max_age = df["Age"].max()
min_age = df["Age"].min()
max_age

27

In [232]:
import pandas as pd
stu = {
    "Name":["Alice","Bob","Charlie"],
    "Age":[24,27,22],
    "City":["New York","Chicago","Boston"],
    "Marks":[85,78,92]
}
# create DataFrame 
df = pd.DataFrame(stu)
filtered_df = df[df["Marks"]==df["Marks"].max()]
loca = df[df["City"]=="New York"]
loca

    Name  Age      City  Marks
0  Alice   24  New York     85

In [260]:
import pandas as pd
stu = {
    "Name":["Alice","Bob","Charlie"],
    "Age":[24,27,22],
    "City":["New York","Chicago","Boston"],
    "Marks":[85,78,92]
}
# create DataFrame 
df = pd.DataFrame(stu)
df.sort_values("City",ascending=True,inplace=True)
df

      Name  Age      City  Marks
2  Charlie   22    Boston     92
1      Bob   27   Chicago     78
0    Alice   24  New York     85

In [254]:
import pandas as pd
stu = {
    "Name":["Alice","Bob","Charlie"],
    "Age":[24,27,22],
    "City":["New York","Chicago","Boston"],
    "Marks":[85,78,92]
}
# create DataFrame 
df = pd.DataFrame(stu)
a = df[["City","Age"]]
a = a[a["City"]=="New York"]
a

       City  Age
0  New York   24

In [69]:
import pandas as pd

data = {
    "name": ["Alice Johnson", "Bob Smith", "Charlie Brown", "David Lee", "Eva Green"],
    "age": [25, 17, 35, 12, 60],
    "email": ["alice@gmail.com", "bob@yahoo.com", "charlie@outlook.com", "david@hotmail.com", "eva@icloud.com"],
    "price": [120, 250, 300, 150, 500],
    "sales": [1000, 1500, 2000, 3000, 400],
    "experience": [2, 1, 10, 0, 20],
    "salary": [50000, 30000, 120000, 15000, 200000],
    "date": ["2024-01-05 14:23:00", "2023-12-15 09:30:45", "2024-02-10 18:10:15", "2023-11-20 07:45:30", "2024-03-01 12:00:00"],
    "review": ["Great product! Works well.", "Not bad, but could be better.", "Excellent! Highly recommend.", "Okay, but had some issues.", "Terrible experience, never again."]
}
df = pd.DataFrame(data)
df["date"] = pd.to_datetime(df["date"])
df
# Apply a 10% discount to the price column and store it in a new column 'discounted_price'.
df["discounted_price"]=df["price"].apply(lambda x:x*0.9)
# Use a lambda function to convert all strings in a 'name' column to uppercase.
df["name"]=df["name"].apply(lambda x: x.upper())
# Extract the email domain from the 'email' column and store it in a new column 'domain'.
df["domain"] = df["email"].apply(lambda x: x.split("@")[1])
# Check for missing values in any column using a lambda function.
df.isnull().apply(lambda x: x.any(),axis =0)
# Create an 'age_group' column that categorizes people as "Child", "Teen", "Adult", or "Senior".
df["age_group"] = df["age"].apply(lambda x: 
    "Child" if x <= 12 else
    "Teen" if x<= 19 else
    "Adult" if x<= 59 else
    "Senior")
#Create a column 'sales_category' where values greater than mean + 2 std dev are "Outlier", otherwise "Normal".
mean_sale = df["sales"].mean()
std_sale = df["sales"].std()
threshold_sale = mean_sale+2*std_sale
df["sales_category"] = df["sales"].apply(lambda x:
    "Outlier" if x>threshold_sale else
    "Normal")
# Convert 'date' to DD/MM/YYYY format using a lambda function.
df["date"] = df["date"].apply(lambda x: x.strftime("%d/%m/%Y"))
# Create a new column 'high_earner' that is True if salary > 100K and experience > 5 years.
df["high_earner"] = df.apply(lambda x: x["salary"] > 100000 and x["experience"] > 5,axis =1)
# Count the number of words in each 'review' using a lambda function.
words = df["review"].apply(lambda x: x.split())
df["count"] = df.apply(lambda x: len(x["review"].split()),axis = 1)
df

,name,age,email,price,sales,experience,salary,date,review,discounted_price,domain,age_group,sales_category,high_earner,count
0,ALICE JOHNSON,25,alice@gmail.com,120,1000,2,50000,05/01/2024,Great product! Works well.,108.0,gmail.com,Adult,Normal,False,4
1,BOB SMITH,17,bob@yahoo.com,250,1500,1,30000,15/12/2023,"Not bad, but could be better.",225.0,yahoo.com,Teen,Normal,False,6
2,CHARLIE BROWN,35,charlie@outlook.com,300,2000,10,120000,10/02/2024,Excellent! Highly recommend.,270.0,outlook.com,Adult,Normal,True,3
3,DAVID LEE,12,david@hotmail.com,150,3000,0,15000,20/11/2023,"Okay, but had some issues.",135.0,hotmail.com,Child,Normal,False,5
4,EVA GREEN,60,eva@icloud.com,500,400,20,200000,01/03/2024,"Terrible experience, never again.",450.0,icloud.com,Senior,Normal,True,4

In [57]:
str1 ="hoang@gmail.com"
count =0
i=0
while i<len(str1):
    count+=1
    i+=1
count

15

In [12]:
import pandas as pd
sales_dict = {"Jan": 10000, "Feb": 12000, "Mar": 15000}

data ={
    "name" :["Hoang","Lan"],
    "grade":[1,6]
}

df =pd.DataFrame(data)
df

    name  grade
0  Hoang      1
1    Lan      6